Revit 2027 API
BuiltInFailures.MEPCalculationFailures.NetworkErrorExtractCurveData Property
 The calculation could not be performed. Verify the pump curve data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkErrorExtractCurveData { get; }
Public Shared ReadOnly Property NetworkErrorExtractCurveData As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkErrorExtractCurveData {
	FailureDefinitionId^ get ();
}
static member NetworkErrorExtractCurveData : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace